### 적재할 Data(csv) 가져오기 ← inner GitLab

In [365]:
import pandas as pd
import numpy as np

import requests
from io import StringIO
import io

import warnings
warnings.filterwarnings('ignore')

In [366]:
! pip install xlrd
! pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in ./.local/lib/python3.6/site-packages (2.0.1)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in ./.local/lib/python3.6/site-packages (3.0.7)
Requirement already satisfied: et-xmlfile in ./.local/lib/python3.6/site-packages (from openpyxl) (1.1.0)

In [367]:
# csv 파일 읽는 방법
# url = "http://10.17.126.123:8929/smyoo/setup_data_db/-/raw/master/raw_data_v1.csv"
# df = pd.read_csv(StringIO(requests.get(url).text))
# print(df.shape)

### pub 발표일 정보 읽어옴

In [475]:
url = "http://10.17.126.123:8929/smyoo/setup_data_db/-/raw/master/data/publication_date.csv"
pub = pd.read_csv(StringIO(requests.get(url).text), encoding='utf-8')
print(pub.shape)
pub

(880, 8)

,yyyymm,bsi,pmi,ext,cpi,ppi,m2,pre
0,2021-04-01,2021-04-29,2021-05-04,2021-05-14,2021-05-04,2021-05-21,2021-05-13,2021-05-31
1,2021-03-01,2021-03-31,2021-04-02,2021-04-14,2021-04-02,2021-04-21,2021-04-13,2021-04-30
2,2021-02-01,2021-02-24,2021-03-02,2021-03-16,2021-03-04,2021-03-24,2021-03-18,2021-03-31
3,2021-01-01,2021-01-28,2021-02-02,2021-02-16,2021-02-02,2021-02-19,2021-02-17,2021-03-02
4,2020-12-01,2020-12-30,2021-01-06,2021-01-14,2020-12-31,2021-01-21,2021-01-13,2021-01-29
...,...,...,...,...,...,...,...,...
875,1948-05-01,NaN,1948-06-02,NaN,NaN,NaN,NaN,NaN
876,1948-04-01,NaN,1948-05-02,NaN,NaN,NaN,NaN,NaN
877,1948-03-01,NaN,1948-04-02,NaN,NaN,NaN,NaN,NaN
878,1948-02-01,NaN,1948-03-02,NaN,NaN,NaN,NaN,NaN
879,1948-01-01,NaN,1948-02-02,NaN,NaN,NaN,NaN,NaN

### db 현재 상태 읽어옴

In [476]:
import pymysql as pydb
from sqlalchemy import create_engine
pydb.install_as_MySQLdb() 
import MySQLdb 

user = "root"
password = "qwe123!@#"
engine = create_engine("mysql+mysqldb://"+user+":"+password+"@10.17.126.105/db_aiam_analysis", encoding='utf-8') 
conn = engine.connect()

target_table = 't_factor_data'
db = pd.read_sql_query(sql='select * from '+ target_table, con=engine)
db['base_date'] = pd.to_datetime(db['base_date'])
print(db.shape)
db.head(3)

(17360, 31)

,base_date,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f,...,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
0,2021-05-10,1.6039,1.712,2.531,0.28,0.71,-0.09,-0.04,86209.0,45970.0,...,NaN,3249.3,10382.0,64.92,NaN,3.69,913892.0,19.417,1000587.0,90.212
1,2021-05-09,1.5772,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN
2,2021-05-08,1.5772,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN

In [477]:
pub

,yyyymm,bsi,pmi,ext,cpi,ppi,m2,pre
0,2021-04-01,2021-04-29,2021-05-04,2021-05-14,2021-05-04,2021-05-21,2021-05-13,2021-05-31
1,2021-03-01,2021-03-31,2021-04-02,2021-04-14,2021-04-02,2021-04-21,2021-04-13,2021-04-30
2,2021-02-01,2021-02-24,2021-03-02,2021-03-16,2021-03-04,2021-03-24,2021-03-18,2021-03-31
3,2021-01-01,2021-01-28,2021-02-02,2021-02-16,2021-02-02,2021-02-19,2021-02-17,2021-03-02
4,2020-12-01,2020-12-30,2021-01-06,2021-01-14,2020-12-31,2021-01-21,2021-01-13,2021-01-29
...,...,...,...,...,...,...,...,...
875,1948-05-01,NaN,1948-06-02,NaN,NaN,NaN,NaN,NaN
876,1948-04-01,NaN,1948-05-02,NaN,NaN,NaN,NaN,NaN
877,1948-03-01,NaN,1948-04-02,NaN,NaN,NaN,NaN,NaN
878,1948-02-01,NaN,1948-03-02,NaN,NaN,NaN,NaN,NaN
879,1948-01-01,NaN,1948-02-02,NaN,NaN,NaN,NaN,NaN

### 함수화

In [496]:
def apply_publication_date(db, dcol, pub, pcol):
    # DB 데이터 타켓1개 준비 + yyyymm 컬럼 추가
    db_bsi = db[['base_date',dcol]]   
#     db_bsi['base_date'] = pd.to_datetime(db_bsi['base_date'])
    db_bsi['yyyymm'] = db_bsi['base_date'].dt.strftime('%Y-%m')
    
    #pub 타겟 1개 가져와서 결측제거
    pub_bsi = pd.DataFrame(pub[['yyyymm', pcol]])
    pub_bsi = pub_bsi.rename(columns={pcol:'base_date'})

    pub_bsi_exist = pub_bsi[pub_bsi['base_date'].notnull()]
    pub_bsi_exist['base_date'] = pd.to_datetime(pub_bsi_exist['base_date'])
    pub_bsi_exist['yyyymm'] = pub_bsi_exist['base_date'].dt.strftime('%Y-%m')    
    start_yyyymm = pub_bsi_exist['yyyymm'].min()

    # pub에 bsi 데이터 먼저 붙이기 (yyyymm 활용)
    db_bsi_exist = db_bsi[db_bsi[dcol].notnull()][['yyyymm',dcol]]
    pub_bsi_exist = pd.merge(pub_bsi_exist, db_bsi_exist, how='outer', on='yyyymm')
    
#     # 일단은 raw 상태로 모든 일자 존재하고, 임의 조정하지 않기로    
#     # 발표일이 Daily 기존 DB 기준으로 미존재 일자(휴일 등)인 경우 → 이후 일자 중 최근접 일로 변경 적용
#     pub_bsi_exist = pub_bsi_exist[pub_bsi_exist['base_date'] <= pd.datetime(2021,5,10)] # 데이터 최근일자 제한
#     pub_bsi_exist = change_missing_publication_date(db_bsi, pub_bsi_exist)

    # pub에는 있고 db1에는 없는 일자 → db1에 추가
    
    ##### 문제지점 > 쪼개긱 전에 전체 데이터를 넘겨서 날짜를 만들어오자
    db_bsi = db_bsi[['base_date',dcol]]
    db_bsi = add_date_to_db(db_bsi, pub_bsi_exist)
    ##### 문제지점
    db_bsi.to_csv('mid_'+dcol+'.csv')
    
    # pub 시작일 기준으로 db 1, 2로 분할
    start_date = pub_bsi_exist['base_date'].min()
    db_bsi1 = db_bsi[db_bsi['base_date'] >= pd.to_datetime(start_date)]
    db_bsi2 = db_bsi[db_bsi['base_date'] < pd.to_datetime(start_date)]    
    
    # db1의 bsi를 pub_exist의 bsi값으로 대체  
    new1 = pd.merge(db_bsi1['base_date'], pub_bsi_exist[['base_date',dcol]], how='left', on='base_date')

    
    new1 = new1[['base_date',dcol]]
    print("merge 결과 new1.shape: ", new1.shape)    
    print("db_bsi2.shape: ", db_bsi2.shape)    
    
    # new1과 db2를 concat하여 마무리
    result = pd.concat([new1, db_bsi2], axis=0)

    print("concat(axis=0) 결과.shape: ", result.shape)
    return result

In [479]:
df1 = db_bsi1
df2 = pub_bsi_exist

#### 존재하는 data에 대한 date를 추가해주는 부분

In [495]:
def add_date_to_db(db_bsi, pub_bsi_exist):          
    for idx, row in pub_bsi_exist.iterrows():
        p_date = row[1]
        p_val = row[2]
        
        if db_bsi[db_bsi['base_date'] == p_date].shape[0] == 0:
            db_bsi.loc[db_bsi.shape[0]] = [p_date, p_val]
    return db_bsi

In [481]:
rs = add_date_to_db(db_bsi1, pub_bsi_exist)

In [482]:
rs[rs['base_date'] == pd.datetime(2003,2,2)]

Empty DataFrame
Columns: [base_date, cpi_yoy]
Index: []

In [483]:
db.columns[15:22]

Index(['bsi_man', 'ism_pmi', 'ext_yoy', 'cpi_yoy', 'ppi_yoy', 'm2_yoy',
       'pre_yoy'],
      dtype='object')

In [484]:
pub.columns[1:]

Index(['bsi', 'pmi', 'ext', 'cpi', 'ppi', 'm2', 'pre'], dtype='object')

In [485]:
rs = apply_publication_date(db,'ext_yoy', pub, 'ext')

쪼개기 전 add_date_to_db 이후  db_bsi.shape:  (7740, 2)
merge 결과 new1.shape:  (6444, 2)
db_bsi2.shape:  (9, 2)
concat(axis=0) 결과.shape:  (6453, 3)

In [486]:
rs['yyyymm'] = rs['base_date'].dt.strftime('%Y-%m')

### Main Loop

In [497]:
for i, (dcol, pcol) in enumerate(zip(db.columns[15:22], pub.columns[1:])):
    print(dcol, pcol)
    if i ==0 :
        result = apply_publication_date(db, dcol, pub, pcol)
    else:
        tmp = apply_publication_date(db,dcol, pub, pcol)
        result = pd.merge(result, tmp, how='left', on='base_date')
        
        print("merge result.shape:", result.shape)
        print("\n\n")

bsi_man bsi
merge 결과 new1.shape:  (5657, 2)
db_bsi2.shape:  (11708, 2)
concat(axis=0) 결과.shape:  (17365, 2)
ism_pmi pmi
merge 결과 new1.shape:  (17675, 2)
db_bsi2.shape:  (1, 2)
concat(axis=0) 결과.shape:  (17676, 2)
merge result.shape: (17365, 3)



ext_yoy ext
merge 결과 new1.shape:  (6457, 2)
db_bsi2.shape:  (10918, 2)
concat(axis=0) 결과.shape:  (17375, 2)
merge result.shape: (17365, 4)



cpi_yoy cpi
merge 결과 new1.shape:  (6454, 2)
db_bsi2.shape:  (10909, 2)
concat(axis=0) 결과.shape:  (17363, 2)
merge result.shape: (17366, 5)



ppi_yoy ppi
merge 결과 new1.shape:  (6473, 2)
db_bsi2.shape:  (10909, 2)
concat(axis=0) 결과.shape:  (17382, 2)
merge result.shape: (17367, 6)



m2_yoy m2
merge 결과 new1.shape:  (6458, 2)
db_bsi2.shape:  (10912, 2)
concat(axis=0) 결과.shape:  (17370, 2)
merge result.shape: (17370, 7)



pre_yoy pre
merge 결과 new1.shape:  (6434, 2)
db_bsi2.shape:  (10929, 2)
concat(axis=0) 결과.shape:  (17363, 2)
merge result.shape: (17370, 8)

### 결과 확인

In [498]:
result[(result['base_date']>=pd.datetime(1980,1,31)) & (result['base_date']<pd.datetime(1980,2,3))]

       base_date  bsi_man  ism_pmi  ext_yoy  cpi_yoy  ppi_yoy  m2_yoy  pre_yoy
12612 1980-02-02      NaN     50.2      NaN      NaN      NaN     NaN      NaN
12613 1980-02-01      NaN      NaN      NaN      NaN      NaN     NaN      NaN
12614 1980-01-31      NaN      NaN     25.5     25.4     28.4     NaN      1.8

In [500]:
result.to_csv('setup_data_db/result.csv')

### db 데이터에서 해달 컬럼을 신규 컬럼으로 대체

In [501]:
order = db.columns
order

Index(['base_date', 'ir_us10y', 'ir_au10y', 'bei_us10y', 'repo', 'cd',
       'low_3f', 'low_10f', 'vol_3f', 'vol_10f', 'fr_3f', 'fr_10f', 'rt_3f',
       'rt_10f', 'bdi', 'bsi_man', 'ism_pmi', 'ext_yoy', 'cpi_yoy', 'ppi_yoy',
       'm2_yoy', 'pre_yoy', 'kospi', 'copper', 'wti', 'fr_bo', 'fr_dur',
       'loan', 'cds5y', 'els_dls', 'dollar'],
      dtype='object')

In [502]:
db1 = db[db.columns.difference(result.columns[1:].tolist())]
db1.columns

Index(['base_date', 'bdi', 'bei_us10y', 'cd', 'cds5y', 'copper', 'dollar',
       'els_dls', 'fr_10f', 'fr_3f', 'fr_bo', 'fr_dur', 'ir_au10y', 'ir_us10y',
       'kospi', 'loan', 'low_10f', 'low_3f', 'repo', 'rt_10f', 'rt_3f',
       'vol_10f', 'vol_3f', 'wti'],
      dtype='object')

In [503]:
db1.head()

,base_date,bdi,bei_us10y,cd,cds5y,copper,dollar,els_dls,fr_10f,fr_3f,...,kospi,loan,low_10f,low_3f,repo,rt_10f,rt_3f,vol_10f,vol_3f,wti
0,2021-05-10,3240.0,2.5310,0.71,19.417,10382.0,90.212,1000587.0,289.0,-2402.0,...,3249.30,913892.0,-0.04,-0.09,0.28,-247.0,-212.0,45970.0,86209.0,64.92
1,2021-05-09,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2021-05-08,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2021-05-07,3183.0,2.5055,0.72,19.698,10417.0,90.233,1003244.0,-1606.0,1649.0,...,3197.20,905418.0,-0.12,-0.13,NaN,38.0,160.0,50664.0,96826.0,64.90
4,2021-05-06,3212.0,2.4567,0.73,19.458,10092.0,90.951,1000875.0,3458.0,7174.0,...,3178.74,911818.0,-0.10,-0.13,0.40,289.0,-159.0,43505.0,85391.0,64.71

In [504]:
new_db = pd.merge(db1, result, how='left', on='base_date')
new_db = new_db[order]
new_db

,base_date,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f,...,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
0,2021-05-10,1.6039,1.712,2.5310,0.28,0.71,-0.09,-0.04,86209.0,45970.0,...,NaN,3249.30,10382.0,64.92,NaN,3.69,913892.0,19.417,1000587.0,90.212
1,2021-05-09,1.5772,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN
2,2021-05-08,1.5772,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN
3,2021-05-07,1.5772,1.680,2.5055,NaN,0.72,-0.13,-0.12,96826.0,50664.0,...,NaN,3197.20,10417.0,64.90,1747801.0,3.66,905418.0,19.698,1003244.0,90.233
4,2021-05-06,1.5679,1.699,2.4567,0.40,0.73,-0.13,-0.10,85391.0,43505.0,...,NaN,3178.74,10092.0,64.71,1745207.0,3.67,911818.0,19.458,1000875.0,90.951
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17360,1948-05-31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17361,1948-04-30,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17362,1948-03-31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17363,1948-02-29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17364,1948-01-31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [505]:
new_db.to_csv('setup_data_db/new_db.csv')

##### (임시 테스트)

In [356]:
dcol='cpi_yoy'
pcol='cpi'

db_bsi = db[['base_date',dcol]]   
#     db_bsi['base_date'] = pd.to_datetime(db_bsi['base_date'])
db_bsi['yyyymm'] = db_bsi['base_date'].dt.strftime('%Y-%m')

#pub 타겟 1개 가져와서 결측제거
pub_bsi = pd.DataFrame(pub[['yyyymm', pcol]])
pub_bsi = pub_bsi.rename(columns={pcol:'base_date'})

pub_bsi_exist = pub_bsi[pub_bsi['base_date'].notnull()]
pub_bsi_exist['base_date'] = pd.to_datetime(pub_bsi_exist['base_date'])
pub_bsi_exist['yyyymm'] = pub_bsi_exist['base_date'].dt.strftime('%Y-%m')    
start_yyyymm = pub_bsi_exist['yyyymm'].min()

# pub에 bsi 데이터 먼저 붙이기 (yyyymm 활용)
db_bsi_exist = db_bsi[db_bsi[dcol].notnull()][['yyyymm',dcol]]
pub_bsi_exist = pd.merge(pub_bsi_exist, db_bsi_exist, how='outer', on='yyyymm')

# pub 시작일 기준으로 db 1, 2로 분할
start_date = pub_bsi_exist['base_date'].min()
db_bsi = db_bsi[['base_date', dcol]]
db_bsi1 = db_bsi[db_bsi['base_date'] >= pd.to_datetime(start_date)]
db_bsi2 = db_bsi[db_bsi['base_date'] < pd.to_datetime(start_date)]

# db1의 bsi를 pub_exist의 bsi값으로 대체
new1 = pd.merge(db_bsi1['base_date'].to_frame(), pub_bsi_exist, how='left', on='base_date')
new1 = new1[['base_date',dcol]]

# new1과 db2를 concat하여 마무리
result = pd.concat([new1, db_bsi2], axis=0)
result.shape

(17361, 2)

In [296]:
pub_bsi_exist[pub_bsi_exist['base_date']==pd.datetime(2003,2,3)]

Empty DataFrame
Columns: [yyyymm, base_date, ism_pmi]
Index: []

In [294]:
pub_bsi_exist[pub_bsi_exist['base_date']==pd.datetime(2003,2,2)]

      yyyymm  base_date  ism_pmi
219  2003-02 2003-02-02     48.8

In [298]:
outer = pd.merge(db_bsi1['base_date'].to_frame(), pub_bsi_exist, how='outer', on='base_date')

In [299]:
outer[outer['base_date']==pd.datetime(2003,2,3)]

      base_date yyyymm  ism_pmi
5655 2003-02-03    NaN      NaN

In [301]:
outer[outer['base_date']==pd.datetime(2003,2,2)]

       base_date   yyyymm  ism_pmi
17384 2003-02-02  2003-02     48.8

In [302]:
outer

       base_date   yyyymm  ism_pmi
0     2021-05-10      NaN      NaN
1     2021-05-09      NaN      NaN
2     2021-05-08      NaN      NaN
3     2021-05-07      NaN      NaN
4     2021-05-06      NaN      NaN
...          ...      ...      ...
17671 1948-05-02  1948-05     49.5
17672 1948-04-02  1948-04     45.4
17673 1948-03-02  1948-03     43.3
17674 1948-02-02  1948-02     50.2
17675        NaT  1948-01     51.7

[17676 rows x 3 columns]

In [233]:
missing_check = pub_bsi_exist[pub_bsi_exist['base_date'].isin(db_bsi['base_date'])==False]
missing_date = missing_check['base_date'][missing_check['base_date'].notnull()]
missing_date

99    2013-02-02
107   2012-06-02
118   2011-07-02
121   2011-04-02
127   2010-10-02
         ...
875   1948-06-02
876   1948-05-02
877   1948-04-02
878   1948-03-02
879   1948-02-02
Name: base_date, Length: 316, dtype: datetime64[ns]

### 발표일이 Daily 기존 DB 기준으로 미존재 일자(휴일 등)인 경우 → 이후 일자 중 최근접 일로 변경 적용

In [275]:
def change_missing_publication_date(db_bsi, pub_bsi_exist):
    missing_check = pub_bsi_exist[pub_bsi_exist['base_date'].isin(db_bsi['base_date'])==False]
    missing_date = missing_check['base_date'][missing_check['base_date'].notnull()]

    for i, d in enumerate(missing_date):
        init = d
        while db_bsi[db_bsi['base_date'] == d].shape[0] == 0:  # 1일씩 더하면서 daily 기준 존재하는 최근접 날짜 정보로 변경 update 한다
            d = d + pd.Timedelta(days=1) # 하루 추가
            
        pub_bsi_exist.loc[pub_bsi_exist['base_date'] == init, 'base_date'] = d   # pub_bsi_exist 기준날짜 변경 적용
    return pub_bsi_exist

In [270]:
rs = change_missing_publication_date(db_bsi, pub_bsi_exist)
rs[rs['base_date']==pd.datetime(2003,2,3)]

      yyyymm  base_date  ism_pmi
219  2003-02 2003-02-03     48.8

In [132]:
db_bsi_exist

        yyyymm  ism_pmi
10     2021-04     60.7
40     2021-03     64.7
71     2021-02     60.8
99     2021-01     58.7
130    2020-12     60.5
...        ...      ...
17355  1948-05     49.5
17356  1948-04     45.4
17357  1948-03     43.3
17358  1948-02     50.2
17359  1948-01     51.7

[880 rows x 2 columns]

In [116]:
pub_bsi_exist[pub_bsi_exist['base_date'] > '2003-01-01']

      yyyymm  base_date
0    2021-05 2021-05-04
1    2021-04 2021-04-02
2    2021-03 2021-03-02
3    2021-02 2021-02-02
4    2021-01 2021-01-06
..       ...        ...
216  2003-05 2003-05-02
217  2003-04 2003-04-02
218  2003-03 2003-03-02
219  2003-02 2003-02-02
220  2003-01 2003-01-02

[221 rows x 2 columns]

In [118]:
pub_bsi_exist[pub_bsi_exist['base_date']=='2003-02-02']

      yyyymm  base_date
219  2003-02 2003-02-02

### (Func 생성 전 1단계씩 진행해본 과정)

### DB 데이터 타켓1개 준비 + yyyymm 컬럼 추가

In [167]:
db_bsi = db[['base_date','bsi_man']]   
db_bsi['base_date'] = pd.to_datetime(db_bsi['base_date'])
db_bsi['yyyymm'] = db_bsi['base_date'].dt.strftime('%Y-%m')
db_bsi.tail(3)

       base_date  bsi_man   yyyymm
17357 1948-03-31      NaN  1948-03
17358 1948-02-29      NaN  1948-02
17359 1948-01-31      NaN  1948-01

### pub 타겟 1개 가져와서 결측제거
* 데이터 존재하는 일자만 있음

In [69]:
pub_bsi_exist = pd.DataFrame(pub[['yyyymm','bsi']])
pub_bsi_exist = pub_bsi_exist.rename(columns={'bsi':'base_date'})
pub_bsi_exist = pub_bsi_exist[pub_bsi_exist['base_date'].notnull()]
pub_bsi_exist['base_date'] = pd.to_datetime(pub_bsi_exist['base_date'])
pub_bsi_exist['yyyymm'] = pub_bsi_exist['base_date'].dt.strftime('%Y-%m')    
start_yyyymm = pub_bsi_exist['yyyymm'].min()

print(start_yyyymm)
pub_bsi_exist.tail(3)

2003-01

      yyyymm  base_date
217  2003-03 2003-04-03
218  2003-02 2003-03-07
219  2003-01 2003-02-07

### pub에 bsi 데이터 붙이기 (yyyymm 활용)

In [70]:
db_bsi_exist = db_bsi[db_bsi['bsi_man'].notnull()][['yyyymm','bsi_man']]
db_bsi_exist.tail(3)

       yyyymm  bsi_man
5615  2003-03     75.0
5636  2003-02     77.0
5656  2003-01     83.0

In [71]:
pub_bsi_exist = pd.merge(pub_bsi_exist, db_bsi_exist, how='left', on='yyyymm')
pub_bsi_exist.tail(3)

      yyyymm  base_date  bsi_man
217  2003-03 2003-04-03     75.0
218  2003-02 2003-03-07     77.0
219  2003-01 2003-02-07     83.0

In [72]:
start_date = pub_bsi_exist['base_date'].min()
start_date

Timestamp('2003-02-07 00:00:00')

### db 전체 일자를 시작일 기준으로 1,2로 쪼갬

In [81]:
db_bsi = db_bsi[['base_date', 'bsi_man']]
db_bsi1 = db_bsi[db_bsi['base_date'] >= pd.to_datetime(start_date)]
db_bsi2 = db_bsi[db_bsi['base_date'] < pd.to_datetime(start_date)]
db_bsi1.tail(3)

      base_date  bsi_man
5649 2003-02-11      NaN
5650 2003-02-10      NaN
5651 2003-02-07      NaN

### db1의 bsi를 pub_exist의 bsi값으로 대체

In [82]:
type(db_bsi1['base_date'].to_frame().iloc[0][0])

pandas._libs.tslibs.timestamps.Timestamp

In [83]:
type(pub_bsi_exist['base_date'].to_frame().iloc[0][0])

pandas._libs.tslibs.timestamps.Timestamp

In [84]:
new1 = pd.merge(db_bsi1['base_date'].to_frame(), pub_bsi_exist, how='left', on='base_date')
new1 = new1[['base_date','bsi_man']]
new1[new1['bsi_man'].notnull()]

      base_date  bsi_man
11   2021-04-29     96.0
40   2021-03-31     89.0
75   2021-02-24     82.0
102  2021-01-28     85.0
131  2020-12-30     82.0
...         ...      ...
5545 2003-07-04     72.0
5590 2003-05-05     81.0
5612 2003-04-03     75.0
5631 2003-03-07     77.0
5651 2003-02-07     83.0

[215 rows x 2 columns]

### new1과 db2를 concat하여 마무리

In [87]:
result = pd.concat([new1, db_bsi2], axis=0)
result

       base_date  bsi_man
0     2021-05-10      NaN
1     2021-05-09      NaN
2     2021-05-08      NaN
3     2021-05-07      NaN
4     2021-05-06      NaN
...          ...      ...
17355 1948-05-31      NaN
17356 1948-04-30      NaN
17357 1948-03-31      NaN
17358 1948-02-29      NaN
17359 1948-01-31      NaN

[17360 rows x 2 columns]

In [89]:
result.to_csv('setup_data_db/pubication_test(bsi).csv')

In [175]:
# new = pd.merge(db_bsi, pub_bsi_exist, how='left', on='base_date')
# new['new_bsi'] = new['bsi_man_x'].astype('float') + new['bsi_man_y'].astype('float')
# new = new[['base_date', 'new_bsi']]
# new

In [ ]:
bdi = get_data(url_blg, 'bdi')
print(bdi.shape)
bdi.head(3)

In [7]:
bsi = get_data(url_blg, 'ism_pmi')
print(bsi.shape)
bsi.head(3)

(880, 2)

        date  ism_pmi
0 2021-04-30     60.7
1 2021-03-31     64.7
2 2021-02-28     60.8

In [8]:
merge_test = pd.merge(bdi, bsi, how='outer', on='date')
print(merge_test.shape)
merge_test.head()

(9717, 3)

        date     bdi  ism_pmi
0 2021-05-10  3240.0      NaN
1 2021-05-07  3183.0      NaN
2 2021-05-06  3212.0      NaN
3 2021-05-05  3266.0      NaN
4 2021-05-04  3157.0      NaN

In [9]:
merge_test[merge_test['date']=='2021-02-28']

           date  bdi  ism_pmi
9118 2021-02-28  NaN     60.8

In [10]:
get_data(url_blg, 'cpi_yoy').head()

        date  cpi_yoy
0 2021-04-30      2.3
1 2021-03-31      1.5
2 2021-02-28      1.1
3 2021-01-31      0.6
4 2020-12-31      0.5

##### ▶[블룸버그] 실제 진행 부분

In [11]:
url_blg = "http://10.17.126.123:8929/smyoo/setup_data_db/-/raw/master/data/bloomberg.xlsx"
li_blg_sh_name = ['ir_au10y',	'bei_us10y',	'bdi',	'bsi_man',	'ism_pmi',	'ext_yoy',	'cpi_yoy',	'ppi_yoy',	'm2_yoy',	'pre_yoy',	'kospi',	'copper',	'wti',	'cds5y',	'dollar']

for i, sh_name in enumerate(li_blg_sh_name):
    part_data  = get_data(url_blg, sh_name)
    print(i, sh_name, part_data.shape, "date 결측치 : ", part_data.isnull().sum()['date'], "전체 마지막: ") # "tail:", part_data.sort_values('date', ascending=False)['date'].tail(1), 
    if i == 0 :
        total = pd.DataFrame(part_data)
    else:
        total = pd.merge(total, part_data, how='outer', on='date')
        
    total = total.sort_values('date', ascending=False)
    
    if total['date'].isnull().sum() > 0:
        total = total.drop(total[total['date'].isnull()].index,0)
        print("▶▶날짜결측치 처리후 : ",total.isnull().sum()['date'])
    
    print("total['date'].tail(1) : ", total['date'].tail(1))

0 ir_au10y (9784, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  9783   1969-07-31
Name: date, dtype: datetime64[ns]
1 bei_us10y (5915, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  9783   1969-07-31
Name: date, dtype: datetime64[ns]
2 bdi (9118, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  9786   1969-07-31
Name: date, dtype: datetime64[ns]
3 bsi_man (220, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  9938   1969-07-31
Name: date, dtype: datetime64[ns]
4 ism_pmi (880, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  10376   1948-01-31
Name: date, dtype: datetime64[ns]
5 ext_yoy (652, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  10376   1948-01-31
Name: date, dtype: datetime64[ns]
6 cpi_yoy (664, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  10376   1948-01-31
Name: date, dtype: datetime64[ns]
7 ppi_yoy (663, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  10376   1948-01-31
Name: date, dtype: datetime64[ns]
8 m2_yoy (410, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  10376   1948-01-31
Name: date, dtype: datetime64[ns]
9 pre_yoy (615, 2) date 결측치 :  17 전체 마지막:
▶▶날짜결측치 처리후 :  0
total['date'].tail(1) :  10376   1948-01-31
Name: date, dtype: datetime64[ns]
10 kospi (11084, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  10376   1948-01-31
Name: date, dtype: datetime64[ns]
11 copper (8860, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  12171   1948-01-31
Name: date, dtype: datetime64[ns]
12 wti (9558, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  12171   1948-01-31
Name: date, dtype: datetime64[ns]
13 cds5y (4407, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  12182   1948-01-31
Name: date, dtype: datetime64[ns]
14 dollar (12916, 2) date 결측치 :  0 전체 마지막:
total['date'].tail(1) :  12182   1948-01-31
Name: date, dtype: datetime64[ns]

In [12]:
total['date'].isnull().sum()

0

In [13]:
total.to_csv('bloom_tmp.csv', index=False)

### 인포맥스

In [14]:
url_info = "http://10.17.126.123:8929/smyoo/setup_data_db/-/raw/master/data/infomax.xlsx"

In [15]:
get_data(url_info, 'cd').head()

        date    cd
0 2021-05-12  0.69
1 2021-05-11  0.69
2 2021-05-10  0.71
3 2021-05-07  0.72
4 2021-05-06  0.73

##### ▶[인포맥스] 실제 수행 부분

In [16]:
total.columns

Index(['date', 'ir_au10y', 'bei_us10y', 'bdi', 'bsi_man', 'ism_pmi', 'ext_yoy',
       'cpi_yoy', 'ppi_yoy', 'm2_yoy', 'pre_yoy', 'kospi', 'copper', 'wti',
       'cds5y', 'dollar'],
      dtype='object')

In [17]:
url_info = "http://10.17.126.123:8929/smyoo/setup_data_db/-/raw/master/data/infomax.xlsx"
li_info_sh_name = ['ir_us10y',	'repo',	'cd',	'low_3f',	'low_10f',	'vol_3f',	'vol_10f',	'fr_3f',	'fr_10f',	'rt_3f',	'rt_10f',	'fr_bo',	'fr_dur',	'loan',	'els_dls']

for i, sh_name in enumerate(li_info_sh_name):
    part_data  = get_data(url_info, sh_name)
    print(i, sh_name, part_data.shape,"date 결측치 : ", part_data.isnull().sum()['date'])
    total = pd.merge(total, part_data, how='outer', on='date')
    
    total = total.sort_values('date', ascending=False)
    
    if total['date'].isnull().sum() > 0:
        total = total.drop(total[total['date'].isnull()].index,0)
        print("▶▶날짜결측치 처리후 : ",total.isnull().sum()['date'])
        
    print("total['date'].tail(1) : ", total['date'].tail(1))

0 ir_us10y (14892, 2) date 결측치 :  0
total['date'].tail(1) :  14370   1948-01-31
Name: date, dtype: datetime64[ns]
1 repo (2494, 2) date 결측치 :  0
total['date'].tail(1) :  16563   1948-01-31
Name: date, dtype: datetime64[ns]
2 cd (3060, 2) date 결측치 :  0
total['date'].tail(1) :  16563   1948-01-31
Name: date, dtype: datetime64[ns]
3 low_3f (5289, 2) date 결측치 :  0
total['date'].tail(1) :  16564   1948-01-31
Name: date, dtype: datetime64[ns]
4 low_10f (3254, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
5 vol_3f (5344, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
6 vol_10f (3268, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
7 fr_3f (5014, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
8 fr_10f (2604, 2) date 결측치 :  588
▶▶날짜결측치 처리후 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
9 rt_3f (5014, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
10 rt_10f (2604, 2) date 결측치 :  588
▶▶날짜결측치 처리후 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
11 fr_bo (4636, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
12 fr_dur (3100, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
13 loan (3100, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]
14 els_dls (3000, 2) date 결측치 :  0
total['date'].tail(1) :  16569   1948-01-31
Name: date, dtype: datetime64[ns]

In [18]:
total.to_csv('before.csv', index=False)

In [19]:
get_data(url_info, 'low_3f').isnull().sum()

date      0
low_3f    0
dtype: int64

In [20]:
total[total['date'].isnull()]

Empty DataFrame
Columns: [date, ir_au10y, bei_us10y, bdi, bsi_man, ism_pmi, ext_yoy, cpi_yoy, ppi_yoy, m2_yoy, pre_yoy, kospi, copper, wti, cds5y, dollar, ir_us10y, repo, cd, low_3f, low_10f, vol_3f, vol_10f, fr_3f, fr_10f, rt_3f, rt_10f, fr_bo, fr_dur, loan, els_dls]
Index: []

[0 rows x 31 columns]

In [21]:
total.columns

Index(['date', 'ir_au10y', 'bei_us10y', 'bdi', 'bsi_man', 'ism_pmi', 'ext_yoy',
       'cpi_yoy', 'ppi_yoy', 'm2_yoy', 'pre_yoy', 'kospi', 'copper', 'wti',
       'cds5y', 'dollar', 'ir_us10y', 'repo', 'cd', 'low_3f', 'low_10f',
       'vol_3f', 'vol_10f', 'fr_3f', 'fr_10f', 'rt_3f', 'rt_10f', 'fr_bo',
       'fr_dur', 'loan', 'els_dls'],
      dtype='object')

In [22]:
from datetime import datetime
total[total['date'] == datetime(2021,3,11)][['date','low_3f']]

         date  low_3f
67 2021-03-11   -0.04

In [23]:
total.head()

,date,ir_au10y,bei_us10y,bdi,bsi_man,ism_pmi,ext_yoy,cpi_yoy,ppi_yoy,m2_yoy,...,vol_3f,vol_10f,fr_3f,fr_10f,rt_3f,rt_10f,fr_bo,fr_dur,loan,els_dls
0,2021-05-20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2021-05-18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2021-05-17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2021-05-14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2021-05-13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [24]:
total = total.reset_index(drop=True)

In [25]:
last_date = '2021-05-10'

In [26]:
total = total.drop(total[total['date'] > last_date].index)
total = total.reset_index(drop=True)
total.head()

,date,ir_au10y,bei_us10y,bdi,bsi_man,ism_pmi,ext_yoy,cpi_yoy,ppi_yoy,m2_yoy,...,vol_3f,vol_10f,fr_3f,fr_10f,rt_3f,rt_10f,fr_bo,fr_dur,loan,els_dls
0,2021-05-10,1.712,2.5310,3240.0,NaN,NaN,NaN,NaN,NaN,NaN,...,86209.0,45970.0,-2402.0,289.0,-212.0,-247.0,NaN,3.69,913892.0,1000587.0
1,2021-05-09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0
2,2021-05-08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0
3,2021-05-07,1.680,2.5055,3183.0,NaN,NaN,NaN,NaN,NaN,NaN,...,96826.0,50664.0,1649.0,-1606.0,160.0,38.0,1747801.0,3.66,905418.0,1003244.0
4,2021-05-06,1.699,2.4567,3212.0,NaN,NaN,NaN,NaN,NaN,NaN,...,85391.0,43505.0,7174.0,3458.0,-159.0,289.0,1745207.0,3.67,911818.0,1000875.0

In [27]:
print(total.shape)
total.tail(3)

(17360, 31)

,date,ir_au10y,bei_us10y,bdi,bsi_man,ism_pmi,ext_yoy,cpi_yoy,ppi_yoy,m2_yoy,...,vol_3f,vol_10f,fr_3f,fr_10f,rt_3f,rt_10f,fr_bo,fr_dur,loan,els_dls
17357,1948-03-31,NaN,NaN,NaN,NaN,43.3,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17358,1948-02-29,NaN,NaN,NaN,NaN,50.2,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17359,1948-01-31,NaN,NaN,NaN,NaN,51.7,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
total.isnull().sum()['date']

0

### 컬럼 순서 변경

In [29]:
total = total[['date',	'ir_us10y',	'ir_au10y',	'bei_us10y',	'repo',	'cd',	'low_3f',	'low_10f',	'vol_3f',	'vol_10f',	'fr_3f',	'fr_10f',	'rt_3f',	'rt_10f',	'bdi',	'bsi_man',	'ism_pmi',	'ext_yoy',	'cpi_yoy',	'ppi_yoy',	'm2_yoy',	'pre_yoy',	'kospi',	'copper',	'wti',	'fr_bo',	'fr_dur',	'loan',	'cds5y',	'els_dls',	'dollar']]
total.head(2)

,date,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f,...,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
0,2021-05-10,1.6039,1.712,2.531,0.28,0.71,-0.09,-0.04,86209.0,45970.0,...,NaN,3249.3,10382.0,64.92,NaN,3.69,913892.0,19.417,1000587.0,90.212
1,2021-05-09,1.5772,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN

In [30]:
total = total.rename(columns={'date':'base_date'})
total.head(1)

,base_date,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f,...,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
0,2021-05-10,1.6039,1.712,2.531,0.28,0.71,-0.09,-0.04,86209.0,45970.0,...,NaN,3249.3,10382.0,64.92,NaN,3.69,913892.0,19.417,1000587.0,90.212

In [31]:
total.iloc[:,:10].describe()

,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f
count,14891.000000,9784.000000,5915.000000,2493.000000,3058.000000,5282.000000,3247.000000,5343.000000,3267.000000
mean,5.985620,6.820761,1.974881,2.130594,2.144513,-0.411477,-0.053338,71655.926259,38440.725436
std,2.970144,3.744179,0.423406,1.026018,0.808633,5.718498,0.564660,45949.673630,27582.490689
min,0.508500,0.611000,-0.024100,0.000000,0.630000,-21.340000,-3.370000,0.000000,0.000000
25%,3.950000,4.167000,1.710500,1.450000,1.530000,-0.170000,-0.100000,39396.000000,10688.000000
50%,5.770000,5.823000,2.017600,2.050000,2.100000,-0.060000,-0.020000,64366.000000,42451.000000
75%,7.720000,9.050250,2.308500,2.620000,2.767500,-0.010000,0.030000,94504.500000,57156.000000
max,15.840000,16.400000,2.783900,5.380000,3.590000,105.320000,2.960000,351906.000000,152599.000000

In [32]:
total.iloc[:,10:20].describe()

,fr_3f,fr_10f,rt_3f,rt_10f,bdi,bsi_man,ism_pmi,ext_yoy,cpi_yoy,ppi_yoy
count,5014.000000,2016.000000,5001.000000,2008.000000,9118.000000,220.000000,880.000000,652.000000,664.000000,663.000000
mean,88.077982,30.698413,6.399120,0.354582,1855.499452,78.322727,52.930909,17.247393,7.027711,5.909502
std,4844.826299,2398.241645,1174.550999,558.441196,1629.826754,10.078705,7.242673,23.018552,6.875092,9.198807
min,-42295.000000,-12136.000000,-18036.000000,-6865.000000,290.000000,43.000000,29.400000,-34.500000,-0.400000,-4.700000
25%,-2139.500000,-1222.500000,-185.000000,-59.000000,1004.000000,72.000000,49.100000,2.600000,2.200000,0.800000
50%,192.000000,100.000000,6.000000,2.000000,1373.000000,78.000000,53.550000,15.150000,4.400000,3.000000
75%,2455.000000,1359.250000,196.000000,60.000000,1836.500000,85.000000,57.500000,26.700000,9.700000,7.900000
max,29147.000000,9469.000000,14371.000000,5461.000000,11793.000000,102.000000,77.500000,149.400000,32.500000,47.400000

In [33]:
total.iloc[:,20:31].describe()

,m2_yoy,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
count,410.000000,598.000000,11084.000000,8860.000000,9554.000000,4.636000e+03,3099.000000,3.099000e+03,4407.000000,2.998000e+03,12916.000000
mean,13.316829,6.486622,1034.640815,4152.950570,43.233787,6.760183e+05,2.843075,3.390969e+05,73.288669,1.026761e+06,97.007808
std,8.385934,4.316606,728.574379,2448.154694,28.033317,4.682265e+05,0.746132,2.190237e+05,66.294633,2.020508e+05,14.634588
min,0.600000,-3.000000,93.100000,1301.700000,-37.630000,4.770000e+03,1.630000,5.250800e+04,13.750000,5.504760e+05,71.329000
25%,6.600000,3.325000,525.267500,1959.875000,20.120000,6.621025e+04,2.150000,1.769845e+05,34.000000,9.406078e+05,86.970000
50%,9.850000,6.300000,840.685000,2903.000000,30.640000,8.518425e+05,2.650000,2.598510e+05,57.171000,1.069712e+06,94.978000
75%,20.700000,8.800000,1773.690000,6502.375000,60.947500,1.009200e+06,3.600000,4.930590e+05,87.706500,1.183012e+06,103.310000
max,34.800000,24.700000,3249.300000,10417.000000,145.290000,1.747801e+06,4.070000,1.003555e+06,674.875000,1.321348e+06,164.720000

### 일괄 INSERT

In [36]:
print(total.shape)
total.tail(3)

(17360, 31)

,base_date,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f,...,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
17357,1948-03-31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17358,1948-02-29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17359,1948-01-31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [37]:
total.columns

Index(['base_date', 'ir_us10y', 'ir_au10y', 'bei_us10y', 'repo', 'cd',
       'low_3f', 'low_10f', 'vol_3f', 'vol_10f', 'fr_3f', 'fr_10f', 'rt_3f',
       'rt_10f', 'bdi', 'bsi_man', 'ism_pmi', 'ext_yoy', 'cpi_yoy', 'ppi_yoy',
       'm2_yoy', 'pre_yoy', 'kospi', 'copper', 'wti', 'fr_bo', 'fr_dur',
       'loan', 'cds5y', 'els_dls', 'dollar'],
      dtype='object')

In [38]:
import datetime
total[total['base_date'] == datetime.datetime(2021,2,28)]

,base_date,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f,...,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
71,2021-02-28,1.4152,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,6.3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1031735.0,NaN

In [39]:
target_table = 't_factor_data'

In [40]:
total.to_sql(name=target_table, con=engine, if_exists='append', index=False) 

# if_exists{‘fail’, ‘replace’, ‘append’}, default ‘fail’
# How to behave if the table already exists.

# fail: Raise a ValueError.
# replace: Drop the table before inserting new values.
# append: Insert new values to the existing table.

### 결과 확인(select)

In [41]:
check = pd.read_sql_query(sql='select * from '+ target_table, con=engine)
print(check.shape)
check.head(3)

(17360, 31)

,base_date,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f,...,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
0,2021-05-10,1.6039,1.712,2.531,0.28,0.71,-0.09,-0.04,86209.0,45970.0,...,NaN,3249.3,10382.0,64.92,NaN,3.69,913892.0,19.417,1000587.0,90.212
1,2021-05-09,1.5772,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN
2,2021-05-08,1.5772,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1003244.0,NaN

In [42]:
type(check.iloc[0][0])

datetime.date

In [43]:
import datetime
check[check['base_date']==datetime.date(2021, 3, 11)]

,base_date,ir_us10y,ir_au10y,bei_us10y,repo,cd,low_3f,low_10f,vol_3f,vol_10f,...,pre_yoy,kospi,copper,wti,fr_bo,fr_dur,loan,cds5y,els_dls,dollar
60,2021-03-11,1.5379,1.653,2.2883,0.6,0.75,-0.04,-0.01,213628.0,70903.0,...,NaN,3013.7,9057.5,66.02,1633354.0,3.92,997786.0,22.067,1038748.0,91.42

In [44]:
check['ir_au10y'] = check['ir_au10y'].round(4)
check['bei_us10y'] = check['bei_us10y'].round(4)

In [45]:
check.to_csv('t_factor_data.csv', index=False)

In [46]:
check.shape

(17360, 31)

In [64]:
conn.close()